[
    ["What is the size of float variable in java?", 
        "a) 8 bit", "b) 16 bit", "c) 32 bit", "d) 64 bit", 
        "c"], 
    ["Consider a C99 function of type void. Which of the following statements is true?", 
        "a) The function must have precisely 0 return statements", 
        "b) The function must have precisely 1 return statement", 
        "c) The function must have at least 1 return statement", 
        "d) The function may have any number of return statements", 
        "b"], 
    ["Which of the following is true about protected access modifier in java?", 
        "a) Variables, methods and constructors which are declared protected can be accessed by any class.", 
        "b) Variables, methods and constructors which are declared protected can be accessed by any class lying in same package.", 
        "c) Variables, methods and constructors which are declared protected in the superclass can be accessed only by its child class.", 
        "d) None of the above.", 
        "c"], 
    ["Method Overriding is an example of", 
        "a) Static Binding", "b) Dynamic Binding", "c) Both of the above", "d) None of the above", 
        "b"], 
    ["What is the default value of short variable in java?", 
        "a) 0.0", "b) 0", "c) null", "d) undefined", 
        "a"], 
    ["What is Encapsulation?", 
        "a) Encapsulation is a technique to define different methods of same type.", 
        "b) Encapsulation is the ability of an object to take on many forms.", 
        "c) Encapsulation is the technique of making the fields in a class private and providing access to the fields via public methods.", 
        "d) None of the above.", 
        "c"], 
    ["What is JIT compiler?", 
        "a) JIT improves the runtime performance of computer programs based on bytecode.", 
        "b) JIT is an application development framework.", 
        "c) JIT is an implementation of the Java Virtual Machine which executes Java programs.", 
        "d) None of the above.", 
        "a"], 
    ["Which is the way in which a thread can enter the waiting state in java?", 
        "a) Invoke its sleep() method.", 
        "b) Invoke object's wait method.", 
        "c) Invoke it's suspend() method.", 
        "d) All of the above.", 
        "d"], 
    ["In java, what will happen if static modifier is removed from the signature of the main method?", 
        "a) Compilation Error.", 
        "b) RunTime Error: NoSuchMethodError.", 
        "c) Program will compile and run without any output.", 
        "d) Program will compile and run to show the required output.", 
        "b"], 
    ["In python, What is the output of print str if str = 'Hello World!'?", 
        "Hello World!", "Error", "str", "None of the above", 
        "a"], 
    ["Which of the following is correct about dictionaries in python?", 
        "a) Python's dictionaries are kind of hash table type.", 
        "b) They work like associative arrays or hashes found in Perl and consist of key-value pairs.", 
        "c) A dictionary key can be almost any Python type, but are usually numbers or strings. Values, on the other hand, can be any arbitrary Python object.", 
        "d) All of the above.", 
        "d"], 
    ["In python, which of the following operator in python evaluates to true if the variables on either side of the operator point to the same object and false otherwise?", 
        "a) **", "b) //", "c) is", "d) not in", 
        "c"], 
    ["In python, What is the output of [1, 2, 3] + [4, 5, 6]?", 
        "a) [1, 2, 3, 4, 5, 6]", 
        "b) [1, 2, 3],[4, 5, 6]", 
        "c) [5, 7, 9]", "d) 21", 
        "a"], 
    ["In python, What is the following function returns item from the list with min value?", 
        "a) cmp(list)", "b) len(list)", "c) max(list)", "d) min(list)", 
        "d"], 
    ["In python, what does def a(b, c, d): pass do?", 
        "a) Defines a list and initializes it", 
        "b) Defines a function, which does nothing", 
        "c) Defines a function, which passes its parameters through", 
        "d) Defines an empty class", 
        "b"], 
    ["What is the size of 'int' in C99?", 
        "a) 2", "b) 4", "c) 8", "d) Compiler dependent", 
        "d"], 
    ["For the definition '#define PI 3.141', what is the data type of 'PI'", 
        "a) float", "b) double", "c) There is no type, it is a text subsitution", "d) Syntax error", 
        "c"], 
    ["Which C99 Library functions help users to dynamically allocate memory?", 
        "a) memalloc() and alloc()", "b) malloc() and memalloc()", "c) malloc and calloc()", "d) memalloc() and calloc()", 
        "c"], 
    ["Which of the following is not a Keyword in C99?", 
        "a) break", "b) float", "c) auto", "d) line", 
        "d"],
    ["The purpose of a class constructor is to",
        "a) Build a user interface", "b) Free memory", "c) Initialize a newly created object", "d) To create a sub class",
        "c"],
    ["Which programming paradigm uses classes?",
        "a) Object-Oreinted", "b) Procedural", "c) Functional", "d) Class-oriented",
        "a"]
]